#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cloudops-practice/cloudops-practice/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cloudops-practice/cloudops-practice

To view this run in a browser, visit:
https://app.terraform.io/app/andrewdq/cloudops-practice/runs/run-d9eXyfSz4Rh1mqgU

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
data.azurerm_client_config.current: Reading...
module.alerts.data.azurerm_subscription.current: Reading...
module.resource_groups["eastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg]
module.resource_groups["southeastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMjIwMzZjMi02YTQ4LTQxODAtYWUyZC1jZmEwZjIzZTBkZjA7b2JqZWN0SWQ9MWRlYmU3NTItZDJhZS00ZTI1LTljMjUtNzc4ZTkzM2U1ZmMwO3N1YnNjcmlwdGlvbklkPTY5NDIxYTAzLWY4ZTYtNGExZS04MWIzLTA3N2FhZWVhNWNlNzt0ZW5hbnRJZD0xNGJhMzgwYi1iOTNhLTRmYzEtYjRlZi04MDM5Y2NhNjFkNzU=]
data.azuread_service_principal.current: Reading...
data.azuread_service_principal.current: Read complete after 1s [id=1debe752-d2ae-4e25-9c25-778e933e5fc0]
module.alerts.data.azurerm_subscription.current: Read complete after 1s [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.OperationalInsights/workspaces/shared-laworkspace]
module.alerts.azurerm_monitor_action_group.alerts: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-roadmap-maker]
module.function.azurerm_app_service_plan.function_app_plan: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/serverFarms/traffic-switch-func-plan]
azurerm_postgresql_flexible_server.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql]
module.secondary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet]
module.traffic-manager.azurerm_traffic_manager_profile.tm_profile: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm]
module.primary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet]
module.secondary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg]
module.primary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg]
module.function.azurerm_storage_account.function_app_storage: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Storage/storageAccounts/trafficswitchfuncsa]
module.alerts.azurerm_consumption_budget_subscription.budget: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/providers/Microsoft.Consumption/budgets/roadmap-maker-annual-budget]
module.secondary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/app]
module.secondary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.traffic-manager.azurerm_traffic_manager_external_endpoint.endpoints["secondary-endpoint"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm/ExternalEndpoints/secondary-endpoint]
module.traffic-manager.azurerm_traffic_manager_external_endpoint.endpoints["primary-endpoint"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/trafficManagerProfiles/roadmap-tm/ExternalEndpoints/primary-endpoint]
module.primary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app]
azurerm_postgresql_flexible_server_firewall_rule.aks_subnet: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAKSSubnet]
azurerm_postgresql_flexible_server_database.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/databases/roadmap_maker]
azurerm_postgresql_flexible_server_active_directory_administrator.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/administrators/1debe752-d2ae-4e25-9c25-778e933e5fc0]
azurerm_postgresql_flexible_server_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAzureServices]
module.secondary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.primary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.secondary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks]
module.primary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks]
module.function.azurerm_function_app.function_app_python: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/sites/traffic-switch-func]
module.primary_monitoring.azurerm_monitor_diagnostic_setting.aks_diagnostics: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks|roadmap-maker-primary-aks-diagnostics]
module.primary_monitoring.azurerm_monitor_action_group.failover: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-failover-func]
module.primary_monitoring.azurerm_monitor_metric_alert.node_not_ready: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/metricAlerts/roadmap-maker-primary-aks-node-not-ready]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.function.azurerm_function_app.function_app_python will be updated in-place
  ~ resource "azurerm_function_app" "function_app_python" {
      ~ app_settings                    = {
          + "AzureWebJobsStorage"         = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION" = "~4"
          + "PROFILE_NAME"                = "roadmap-maker-tm"
          + "RESOURCE_GROUP"              = "roadmap-maker-southeastasia-rg"
          + "SUBSCRIPTION_ID"             = "69421a03-f8e6-4a1e-81b3-077aaeea5ce7"
          + "WEBSITE_RUN_FROM_PACKAGE"    = "https://trafficswitchfuncsa.blob.core.windows.net/function-releases/function-code.zip"
            # (1 unchanged element hidden)
        }
        id                              = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Web/sites/traffic-switch-func"
        name                            = "traffic-switch-func"
        tags                            = {}
        # (19 unchanged attributes hidden)

      + identity {
          + type = "SystemAssigned"
        }

        # (3 unchanged blocks hidden)
    }

  # module.function.azurerm_storage_blob.function_zip will be created
  + resource "azurerm_storage_blob" "function_zip" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "function-code.zip"
      + parallelism            = 8
      + size                   = 0
      + source                 = "modules/function/../../../function-code.zip"
      + storage_account_name   = "trafficswitchfuncsa"
      + storage_container_name = "function-releases"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.function.azurerm_storage_container.function_code will be created
  + resource "azurerm_storage_container" "function_code" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "function-releases"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "trafficswitchfuncsa"
    }

  # module.primary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks"
        name                                = "roadmap-maker-primary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "primary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "primary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "primary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "primary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.secondary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks"
        name                                = "roadmap-maker-secondary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "secondary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "secondary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "secondary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "secondary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with module.function.azurerm_app_service_plan.function_app_plan,
│   on modules/function/main.tf line 23, in resource "azurerm_app_service_plan" "function_app_plan":
│   23: resource "azurerm_app_service_plan" "function_app_plan" {
│ 
│ The `azurerm_app_service_plan` resource has been superseded by the
│ `azurerm_service_plan` resource. Whilst this resource will continue to be
│ available in the 2.x and 3.x releases it is feature-frozen for
│ compatibility purposes, will no longer receive any updates and will be
│ removed in a future major release of the Azure Provider.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @Thanh8804, Action: `pull_request`*